// lib/constants/knu_data.dart  ← 새로 생성

const Map<String, List<String>> knuDepartments = {
  '간호대학': ['간호학과'],
  '경영대학': ['경영·회계학부 (경영학전공)','경영·회계학부 (회계학전공)', '경제·정보통계학부 (경제학전공)', '경제·정보통계학부 (정보통계학전공)', '관광경영학과', '국제무역학과', '경영대학 자유전공학과'],
  '농업생명과학대학': ['생명·환경융합학부 (바이오환경화학전공)', '생명·환경융합학부 (환경과학전공)', '생물자원과학부 (식물자원응용과학전공)', '생물자원과학부 (식물의학전공)', '스마트팜농산업학과', '스마트팜농산업학과', '스마트팜융합바이오시스템공학과', '식품생명공학과', '식품자원경제학과', '원예학과', '지역건설공학과', '농업생명과학대학 자유전공학과'],
  '동물생명과학대학': ['동물산업융합학과', '동물응용과학과', '동물자원과학과', '동물생명과학대학 자유전공학과'],
  '문화예술·공과대학':['건축학과','건축공학과','기계융합공학부','배터리융합공학과','스마트산업공학과','에너지자원공학과','토목공학과','화공·생물공학부 (생물공학전공)','화공·생물공학부 (화학공학전공)','환경공학과','영상문화학과','디자인학과','무용학과','미술학과','스포츠과학과','음악학과'],
  '사범대학':['가정교육과','과학교육학부','교육학과','국어교육과','수학교육과','역사교육과','영어교육과','윤리교육과','일반사회교육과','지리교육과','체육교육과','한문교육과'],
  '사회과학대학':['문화인류학과','미디어커뮤니케이션학과','부동산학과','사회학과','심리학과','정치외교학과','행정학과','사회과학대학 자유전공학과'],
  '산림환경과학대학':['산림경영학과','산림자원학과','산림환경보호학과','산림바이오소재공학과','생태조경디자인학과','펄프제지공학과','산림환경과학대학 자유전공학과'],
  '수의과대학':['수의학과'],
  '약학대학':['약학과'],
  '의과대학':['의예과'],
  '의생명과학대학':['분자생명과학과','생명건강공학과','생물의소재공학과','의생명시스템과학과','의생명공학과','의생명과학대학 자유전공학과'],
  '인문대학':['국어국문학과','독어독문학과','불어불문학과','사학과','영어영문학과','일본학과','중어중문학과','철학과','인문대학 자유전공학과'],
  '자연과학대학':['반도체물리학과','생명과학과','수학과','지질·지구물리학부 (지구물리학전공)','지질·지구물리학부 (지질학전공)','화학·생화학부 (생화학전공)','화학·생화학부 (화학전공)','자연과학대학 자유전공학과'],
  'IT대학':['전기전자공학과','전자공학과','컴퓨터공학과','AI융합학과','디지털밀리터리학과'],
  '독립학부':['자유전공학부']
};

const List<String> countries = [
  '🇳🇵 네팔', '🇹🇼 대만', '🇰🇷 대한민국', '🇩🇪 독일',
  '🇷🇺 러시아', '🇲🇾 말레이시아', '🇲🇳 몽골', '🇺🇸 미국',
  '🇲🇲 미얀마', '🇻🇳 베트남', '🇧🇷 브라질', '🇪🇸 스페인',
  '🇬🇧 영국', '🇺🇿 우즈베키스탄', '🇮🇹 이탈리아', '🇮🇳 인도',
  '🇮🇩 인도네시아', '🇯🇵 일본', '🇰🇿 카자흐스탄', '🇨🇦 캐나다',
  '🇹🇭 태국', '🇫🇷 프랑스', '🇵🇭 필리핀', '🇦🇺 호주',
  '기타',
];