// lib/constants/knu_data.dart  ← 새로 생성

const Map<String, List<String>> knuDepartments = {
  '간호대학': ['간호학과'],
  '경영대학': ['경영·회계학부 (경영학전공)','경영·회계학부 (회계학전공)' '경제·정보통계학부 (경제학전공)', '경제·정보통계학부 (정보통계학전공)', '관광경영학과', '국제무역학과', '경영대학 자유전공학과'],
  '농업생명과학대학': ['생명·환경융합학부 (바이오환경화학전공)', '생명·환경융합학부 (환경과학전공)', '생물자원과학부 (식물자원응용과학전공)', '생물자원과학부 (식물의학전공)', '스마트팜농산업학과', '스마트팜농산업학과', '스마트팜융합바이오시스템공학과', '식품생명공학과', '식품자원경제학과', '원예학과', '지역건설공학과', '농업생명과학대학 자유전공학과'],
  '동물생명과학대학': ['동물산업융합학과', '동물응용과학과', '동물자원과학과', '동물생명과학대학 자유전공학과']
};

const List<String> countries = [
  '대한민국', '중국', '일본', '미국',
  '베트남', '몽골', '우즈베키스탄',
  '프랑스', '독일', '영국', '기타',
];